# PET Clone - Open hardware implementation of the Commodore PET
# by Daniel Lehenbauer and contributors.
# 
# https://github.com/DLehenbauer/commodore-pet-clone
#
# To the extent possible under law, I, Daniel Lehenbauer, have waived all
# copyright and related or neighboring rights to this project. This work is
# published from the United States.
#
# @copyright CC0 http://creativecommons.org/publicdomain/zero/1.0/
# @author Daniel Lehenbauer <DLehenbauer@users.noreply.github.com> and contributors

# (See also generated file: outflow\PET.pt.sdc)

# PLL Constraints
#################
create_clock -period 62.5000 clk16_i

# GPIO Constraints
####################
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {clk_50_i}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {clk_50_i}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {spi1_cs_ni}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {spi1_cs_ni}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {spi1_sck_i}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {spi1_sck_i}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {spi1_mcu_tx_i}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {spi1_mcu_tx_i}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {bus_addr_16_o}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {bus_addr_16_o}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {cpu_clk_o}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {cpu_clk_o}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {h_sync_o}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {h_sync_o}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {io_oe_no}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {io_oe_no}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {pia1_cs2_no}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {pia1_cs2_no}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {pia2_cs2_no}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {pia2_cs2_no}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ram_addr_o[10]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ram_addr_o[10]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ram_addr_o[11]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ram_addr_o[11]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {spi_ready_no}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {spi_ready_no}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {status_no}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {status_no}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {v_sync_o}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {v_sync_o}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {via_cs2_no}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {via_cs2_no}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {video_o}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {video_o}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {bus_addr_15_0_i[4]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {bus_addr_15_0_i[4]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {bus_addr_15_0_o[4]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {bus_addr_15_0_o[4]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {bus_addr_15_0_oe[4]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {bus_addr_15_0_oe[4]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {bus_addr_15_0_i[5]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {bus_addr_15_0_i[5]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {bus_addr_15_0_o[5]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {bus_addr_15_0_o[5]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {bus_addr_15_0_oe[5]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {bus_addr_15_0_oe[5]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {bus_addr_15_0_i[6]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {bus_addr_15_0_i[6]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {bus_addr_15_0_o[6]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {bus_addr_15_0_o[6]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {bus_addr_15_0_oe[6]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {bus_addr_15_0_oe[6]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {bus_addr_15_0_i[7]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {bus_addr_15_0_i[7]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {bus_addr_15_0_o[7]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {bus_addr_15_0_o[7]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {bus_addr_15_0_oe[7]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {bus_addr_15_0_oe[7]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {bus_addr_15_0_i[8]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {bus_addr_15_0_i[8]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {bus_addr_15_0_o[8]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {bus_addr_15_0_o[8]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {bus_addr_15_0_oe[8]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {bus_addr_15_0_oe[8]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {bus_addr_15_0_i[9]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {bus_addr_15_0_i[9]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {bus_addr_15_0_o[9]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {bus_addr_15_0_o[9]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {bus_addr_15_0_oe[9]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {bus_addr_15_0_oe[9]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {bus_addr_15_0_i[10]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {bus_addr_15_0_i[10]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {bus_addr_15_0_o[10]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {bus_addr_15_0_o[10]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {bus_addr_15_0_oe[10]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {bus_addr_15_0_oe[10]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {bus_addr_15_0_i[11]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {bus_addr_15_0_i[11]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {bus_addr_15_0_o[11]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {bus_addr_15_0_o[11]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {bus_addr_15_0_oe[11]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {bus_addr_15_0_oe[11]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {bus_data_7_0_i[0]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {bus_data_7_0_i[0]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {bus_data_7_0_o[0]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {bus_data_7_0_o[0]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {bus_data_7_0_oe[0]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {bus_data_7_0_oe[0]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {bus_data_7_0_i[1]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {bus_data_7_0_i[1]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {bus_data_7_0_o[1]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {bus_data_7_0_o[1]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {bus_data_7_0_oe[1]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {bus_data_7_0_oe[1]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {bus_data_7_0_i[2]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {bus_data_7_0_i[2]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {bus_data_7_0_o[2]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {bus_data_7_0_o[2]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {bus_data_7_0_oe[2]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {bus_data_7_0_oe[2]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {bus_data_7_0_i[3]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {bus_data_7_0_i[3]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {bus_data_7_0_o[3]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {bus_data_7_0_o[3]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {bus_data_7_0_oe[3]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {bus_data_7_0_oe[3]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {bus_data_7_0_i[4]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {bus_data_7_0_i[4]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {bus_data_7_0_o[4]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {bus_data_7_0_o[4]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {bus_data_7_0_oe[4]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {bus_data_7_0_oe[4]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {bus_data_7_0_i[5]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {bus_data_7_0_i[5]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {bus_data_7_0_o[5]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {bus_data_7_0_o[5]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {bus_data_7_0_oe[5]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {bus_data_7_0_oe[5]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {bus_data_7_0_i[6]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {bus_data_7_0_i[6]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {bus_data_7_0_o[6]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {bus_data_7_0_o[6]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {bus_data_7_0_oe[6]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {bus_data_7_0_oe[6]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {bus_data_7_0_i[7]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {bus_data_7_0_i[7]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {bus_data_7_0_o[7]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {bus_data_7_0_o[7]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {bus_data_7_0_oe[7]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {bus_data_7_0_oe[7]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {bus_rw_ni}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {bus_rw_ni}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {bus_rw_no}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {bus_rw_no}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {bus_rw_noe}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {bus_rw_noe}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {cpu_res_nai}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {cpu_res_nai}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {cpu_res_nao}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {cpu_res_nao}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {cpu_res_naoe}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {cpu_res_naoe}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {spi1_mcu_rx_i}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {spi1_mcu_rx_i}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {spi1_mcu_rx_o}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {spi1_mcu_rx_o}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {spi1_mcu_rx_oe}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {spi1_mcu_rx_oe}]

# LVDS RX GPIO Constraints
############################
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {cpu_be_o}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {cpu_be_o}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {bus_addr_15_0_i[0]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {bus_addr_15_0_i[0]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {bus_addr_15_0_o[0]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {bus_addr_15_0_o[0]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {bus_addr_15_0_oe[0]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {bus_addr_15_0_oe[0]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {bus_addr_15_0_i[1]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {bus_addr_15_0_i[1]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {bus_addr_15_0_o[1]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {bus_addr_15_0_o[1]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {bus_addr_15_0_oe[1]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {bus_addr_15_0_oe[1]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {bus_addr_15_0_i[2]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {bus_addr_15_0_i[2]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {bus_addr_15_0_o[2]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {bus_addr_15_0_o[2]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {bus_addr_15_0_oe[2]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {bus_addr_15_0_oe[2]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {bus_addr_15_0_i[3]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {bus_addr_15_0_i[3]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {bus_addr_15_0_o[3]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {bus_addr_15_0_o[3]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {bus_addr_15_0_oe[3]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {bus_addr_15_0_oe[3]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {bus_addr_15_0_i[12]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {bus_addr_15_0_i[12]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {bus_addr_15_0_o[12]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {bus_addr_15_0_o[12]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {bus_addr_15_0_oe[12]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {bus_addr_15_0_oe[12]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {bus_addr_15_0_i[13]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {bus_addr_15_0_i[13]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {bus_addr_15_0_o[13]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {bus_addr_15_0_o[13]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {bus_addr_15_0_oe[13]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {bus_addr_15_0_oe[13]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {bus_addr_15_0_i[14]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {bus_addr_15_0_i[14]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {bus_addr_15_0_o[14]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {bus_addr_15_0_o[14]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {bus_addr_15_0_oe[14]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {bus_addr_15_0_oe[14]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {bus_addr_15_0_i[15]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {bus_addr_15_0_i[15]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {bus_addr_15_0_o[15]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {bus_addr_15_0_o[15]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {bus_addr_15_0_oe[15]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {bus_addr_15_0_oe[15]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {cpu_irq_ni}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {cpu_irq_ni}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {cpu_irq_no}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {cpu_irq_no}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {cpu_irq_noe}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {cpu_irq_noe}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {cpu_nmi_ni}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {cpu_nmi_ni}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {cpu_nmi_no}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {cpu_nmi_no}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {cpu_nmi_noe}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {cpu_nmi_noe}]

# LVDS Rx Constraints
####################

# LVDS TX GPIO Constraints
############################
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {diag_i}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {diag_i}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {gfx_i}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {gfx_i}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {via_cb2_i}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {via_cb2_i}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {audio_o}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {audio_o}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {cpu_ready_o}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {cpu_ready_o}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ram_ce_no}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ram_ce_no}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ram_oe_no}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ram_oe_no}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ram_we_no}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ram_we_no}]

# LVDS Tx Constraints
####################
